Rokasbarasa1/STM32-Quadcopter/src/main.c
// ------------------------------------------------------------------------------------------------------ Sensor other data
float acceleration_data[] = {0,0,0};
float gyro_angular[] = {0,0,0};
float imu_orientation[] = {0,0,0};
float magnetometer_data[] = {0,0,0};
float gps_longitude = 0.0;
float old_gps_longitude = 0.0;
float gps_latitude = 0.0;
float old_gps_latitude = 0.0;
float delta_gps_latitude = 0.0;
float delta_gps_longitude = 0.0;
float in_between_gps_latitude = 0.0;
float in_between_gps_longitude = 0.0;
uint8_t in_between_gps_loop_divider = 50;
uint8_t in_between_gps_loop_divider_counter = 0;
uint8_t gps_fix_type = 0.0;
uint8_t got_gps = 0;

float pressure = 0.0;
float temperature = 0.0;
float altitude = 0.0;
float vertical_velocity = 0.0;


uint8_t gps_position_hold_enabled = 0;
uint8_t gps_target_set = 0;

uint8_t use_gps_reset_count = 0;
uint8_t use_gps_reset_count_to_deactivate = 10; // This is done because sometimes some noise sends a neutural pitch and roll

float gps_hold_roll_adjustment_integral = 0.0;
float gps_hold_pitch_adjustment_integral = 0.0;

float roll_effect_on_lat = 0;
float pitch_effect_on_lat = 0;

float roll_effect_on_lon = 0;
float pitch_effect_on_lon = 0;

// ------------------------------------------------------------------------------------------------------ Sensor fusion and filtering stuff
float complementary_beta = 0.0;
float complementary_ratio = 1.0 - 1.0/(1.0+(1.0/REFRESH_RATE_HZ)); // Depends on how often the loop runs. 1 second / (1 second + one loop time)

float filtering_magnetometer_cutoff_frequency = 180; // 200Hz sample rate and 0.85 alpha gives 180Hz cutoff and around 1ms delay
float filtering_accelerometer_cutoff_frequency = 40; // 200Hz sample rate and 0.386 alpha gives 20Hz cutoff and around 1ms delay

float rpm_notch_filter_q_value = 500; // Default in betaflight

float rpm_notch_filter_min_frequency = 100; // Hz

struct low_pass_filter filter_magnetometer_x;
struct low_pass_filter filter_magnetometer_y;
struct low_pass_filter filter_magnetometer_z;

struct low_pass_filter filter_accelerometer_x;
struct low_pass_filter filter_accelerometer_y;
struct low_pass_filter filter_accelerometer_z;

struct notch_filter gyro_x_filter_motor_FR;
struct notch_filter gyro_x_filter_motor_FL;
struct notch_filter gyro_x_filter_motor_BR;
struct notch_filter gyro_x_filter_motor_BL;

struct notch_filter gyro_y_filter_motor_FR;
struct notch_filter gyro_y_filter_motor_FL;
struct notch_filter gyro_y_filter_motor_BR;
struct notch_filter gyro_y_filter_motor_BL;

struct notch_filter gyro_z_filter_motor_FR;
struct notch_filter gyro_z_filter_motor_FL;
struct notch_filter gyro_z_filter_motor_BR;
struct notch_filter gyro_z_filter_motor_BL;

struct kalman_filter altitude_and_velocity_kalman;
// ------------------------------------------------------------------------------------------------------ Remote control settings
float max_yaw_attack = 40.0;
float max_roll_attack = 10;
float max_pitch_attack = 10;
float roll_attack_step = 0.2;
float pitch_attack_step = 0.2;
float max_throttle_vertical_velocity = 30; // cm/second

float throttle = 0.0;
float yaw = 50.0;
float last_yaw = 50.0;
float pitch = 50.0;
float roll = 50.0;

float minimum_signal_timing_seconds = 0.2; // Seconds
uint64_t last_signal_timestamp_microseconds = 0;

// ------------------------------------------------------------------------------------------------------ Logging to SD card
char log_file_base_name[] = "Quadcopter.txt";
char log_file_blackbox_base_name[] = "Quadcopter.BBL";
char *new_log_file_blackbox_base_name;
uint16_t file_index = 0;

uint8_t sd_card_initialized = 0;
uint8_t log_loop_count = 0;
uint8_t sd_card_async = 0;
const uint8_t use_simple_async = 0; // 0 is the complex async
const uint8_t use_blackbox_logging = 1; 

// ------------------------------------------------------------------------------------------------------ Stuff for blackbox logging
uint32_t loop_iteration = 1;
float PID_proportional[3];
float PID_integral[3];
float PID_derivative[2];
float PID_feed_forward[3];
float PID_set_points[4];
float remote_control[4];

// ------------------------------------------------------------------------------------------------------ Flight mode settings
// Flight modes:
// (0) - acro
// (1) - angle
// (2) - angle with altitude hold
// (3) - angle with altitude hold and gps hold
// (4) - angle with gps hold and without ltitude hold

uint8_t flight_mode = 0;

uint8_t use_angle_mode = 0;
uint8_t use_vertical_velocity_control = 0;
uint8_t use_gps_hold = 0;

uint32_t radio = 0;
uint32_t radio2 = 0;
uint32_t radio_end = 0;

uint32_t sensors = 0;
uint32_t sensors2 = 0;
uint32_t sensors3 = 0;
uint32_t sensors4 = 0;
uint32_t sensors5 = 0;
uint32_t sensors6 = 0;
uint32_t sensors7 = 0;
uint32_t sensors8 = 0;
uint32_t sensors_end = 0;

uint32_t motor = 0;
uint32_t motor2 = 0;
uint32_t motor3 = 0;
uint32_t motor4 = 0;
uint32_t motor5 = 0;
uint32_t motor6 = 0;
uint32_t motor_end = 0;

uint32_t logging = 0;
uint32_t logging2 = 0;
uint32_t logging3 = 0;
uint32_t logging_end = 0;



int main(void){
    init_STM32_peripherals();
    accelerometer_roll_offset = base_accelerometer_roll_offset;
    accelerometer_pitch_offset = base_accelerometer_pitch_offset;
    // Turn off the blue led. Will show the status of sd logging later
    HAL_GPIO_WritePin(GPIOC, GPIO_PIN_13, GPIO_PIN_SET);
    printf("STARTING PROGRAM\n"); 
    

    
    if(init_drivers() == 0) return 0; // exit if initialization failed

    HAL_Delay(2000); // Dont want to interfere in calibration

    set_flight_mode(flight_mode);
    // check_calibrations();
    calibrate_gyro(); // Recalibrate the gyro as the temperature affects the calibration
    get_initial_position();
    // setup_logging_to_sd(0);
    initialize_control_abstractions();
    initialize_motor_communication();

    handle_pre_loop_start();
    CoreDebug->DEMCR |= CoreDebug_DEMCR_TRCENA_Msk;  
    DWT->CYCCNT = 0;                                // Reset the cycle counter
    DWT->CTRL |= DWT_CTRL_CYCCNTENA_Msk;

    while (1){
        // Get current time
        handle_loop_start();
        DWT->CYCCNT = 0;

        radio = DWT->CYCCNT;
        handle_radio_communication();
        radio_end = DWT->CYCCNT;

        sensors = DWT->CYCCNT;
        handle_get_and_calculate_sensor_values(); // Important do do this right before the pid stuff.
        sensors_end = DWT->CYCCNT;


        motor = DWT->CYCCNT;
        handle_pid_and_motor_control();
        motor_end = DWT->CYCCNT;


        logging = DWT->CYCCNT;
        handle_logging();
        logging_end = DWT->CYCCNT;

        handle_loop_end();

        // printf("2r %lu\n", radio2 - radio);
        // printf("1r %lu\n", radio_end - radio);

        // printf("2s %lu\n", sensors2 - sensors);
        // printf("3s %lu\n", sensors3 - sensors2);
        // printf("4s %lu\n", sensors4 - sensors3);
        // printf("5s %lu\n", sensors5 - sensors4);
        // printf("6s %lu\n", sensors6 - sensors5);
        // printf("7s %lu\n", sensors7 - sensors6);
        // printf("8s %lu\n", sensors8 - sensors7);
        // printf("1s %lu\n", sensors_end - sensors);

        // printf("2m %lu\n", motor2 - motor);
        // printf("3m %lu\n", motor3 - motor2);
        // printf("4m %lu\n", motor4 - motor3);
        // printf("5m %lu\n", motor5 - motor4);
        // printf("6m %lu\n", motor6 - motor6);
        // printf("1m %lu\n", motor_end - motor);

        // printf("2L %lu\n", logging2 - logging);
        // printf("3L %lu\n", logging3 - logging2);
        // printf("1L %lu\n", logging_end - logging);

        // printf("(%lu + %lu + %lu + %lu)/100000000 = %.5f\n\n", 
        //     radio_end - radio,
        //     sensors_end - sensors,
        //     motor_end - motor,
        //     logging_end - logging,
        //     ((float)(radio_end - radio) + (sensors_end - sensors) + (motor_end - motor) + (logging_end - logging)) / 100000000.0
        // );

