Rokasbarasa1/STM32-Quadcopter/src/main.c
        // printf("Motor BL: %5.1f BR: %5.1f FR: %5.1f FL: %5.1f\n",
        //     motor_rpm[0],
        //     motor_rpm[1],
        //     motor_rpm[2],
        //     motor_rpm[3]
        // );

        // printf("%.1f\n",
        //     motor_rpm[0]
        // );


    }
}

uint8_t init_drivers(){
    printf("-----------------------------INITIALIZING MODULES...\n");

    uint8_t mpu6050 = init_mpu6050(
        &hi2c1, 
        ACCEL_CONFIG_RANGE_2G, 
        GYRO_CONFIG_RANGE_500_DEG, 
        // LOW_PASS_FILTER_FREQUENCY_CUTOFF_GYRO_21HZ_ACCEL_20HZ,
        LOW_PASS_FILTER_FREQUENCY_CUTOFF_GYRO_260HZ_ACCEL_256HZ,
        1, 
        accelerometer_scale_factor_correction, 
        accelerometer_correction, 
        gyro_correction, 
        REFRESH_RATE_HZ, 
        complementary_ratio, 
        complementary_beta
    );

    uint8_t mmc5603 = mmc5603_init(&hi2c1, 1, magnetometer_hard_iron_correction, magnetometer_soft_iron_correction, 1, 200, 1);
    uint8_t bmp280 = init_bmp280(&hi2c1);
    uint8_t bn357 = init_bn357(&huart2, &hdma_usart2_rx, 1);
    uint8_t nrf24 = init_nrf24(&hspi1);

    printf("-----------------------------INITIALIZING MODULES DONE... ");

    if (mpu6050 && mmc5603 && bmp280 && bn357 && nrf24){
        printf("OK\n");
    }else{
        printf("NOT OK\n");
        return 0;
    }

    // Continue initializing
    nrf24_rx_mode(tx_address, 10);
    bn357_start_uart_interrupt();

    return 1;
}

void handle_get_and_calculate_sensor_values(){
    // ------------------------------------------------------------------------------------------------------ Reset
    // Reset the values to make it easier to find broken sensor later
    reset_array_data(acceleration_data, 3);
    reset_array_data(gyro_angular, 3);
    reset_array_data(magnetometer_data, 3);
    temperature = 0.0f;
    altitude = 0.0f;
    vertical_velocity = 0.0f;

    // ------------------------------------------------------------------------------------------------------ Get the sensor data
    // Get data from motors
    // Block until the motors allow to convert the value
    // if(bdshot600_convert_all_responses()){
    if(bdshot600_dma_convert_all_responses(1)){

        // Motor 0 - BL, 1 - BR, 2 - FR, 3 - FL
        motor_frequency[0] = bdshot600_dma_get_frequency(motor_BL);
        motor_frequency[1] = bdshot600_dma_get_frequency(motor_BR);
        motor_frequency[2] = bdshot600_dma_get_frequency(motor_FR);
        motor_frequency[3] = bdshot600_dma_get_frequency(motor_FL);

        motor_rpm[0] = bdshot600_dma_get_rpm(motor_BL); 
        motor_rpm[1] = bdshot600_dma_get_rpm(motor_BR);
        motor_rpm[2] = bdshot600_dma_get_rpm(motor_FR);
        motor_rpm[3] = bdshot600_dma_get_rpm(motor_FL);
    }

    sensors2 = DWT->CYCCNT;

    // Disable interrupts as they heavily impact the i2c communication
    __disable_irq();
    temperature = bmp280_get_temperature_celsius(); // Temperature will probably not change
    altitude = bmp280_get_height_centimeters_from_reference(0);
    sensors3 = DWT->CYCCNT;
    mmc5603_magnetometer_readings_micro_teslas(magnetometer_data);
    sensors4 = DWT->CYCCNT;
    mpu6050_get_accelerometer_readings_gravity(acceleration_data);
    mpu6050_get_gyro_readings_dps(gyro_angular);
    __enable_irq();

    sensors5 = DWT->CYCCNT;

    bn357_parse_data(); // Try to parse gps
    gps_latitude = bn357_get_latitude_decimal_format();
    gps_longitude = bn357_get_linear_longitude_decimal_format(); // Linear for pid
    gps_fix_type = bn357_get_fix_type();
    got_gps = bn357_get_status_up_to_date(1);

    // Pitch (+)forwards - front of device nose goes down
    // Roll (+)right - the device banks to the right side while pointing forward
    // After yaw calculation yaw has to be 0/360 when facing north in the pitch+ axis
    // After getting roll and pitch from accelerometer. Pitch forwards -> +Pitch. Roll right -> +Roll
    rotate_magnetometer_output_90_degrees_anti_clockwise(magnetometer_data);
    invert_axies(acceleration_data);
    invert_axies(gyro_angular);
    // Pitch device forwards -> Y axis positive. Roll device right -> X axis positive
    // ------------------------------------------------------------------------------------------------------ Filter the sensor data
    sensors6 = DWT->CYCCNT;

    // Notch filter: https://www.youtube.com/watch?v=ysS4bIXFAsU
    // Filtering rpm: https://www.youtube.com/watch?v=NCDyA9bnf4I&t=192s


    
    // Gyro RPM filtering
    // Filter the gyro using each of the rpm's from the motors
    // 4 notch filters with 3 harmonics
    
    // Dynamic filtering

    // if(motor_frequency[0] >= rpm_notch_filter_min_frequency){
    if(motor_frequency[0] > 0){

        // Apply new notch filter focus
        notch_filter_set_center_frequency_Q_constant(&gyro_x_filter_motor_BL, motor_frequency[0]);
        notch_filter_set_center_frequency_Q_constant(&gyro_x_filter_motor_BR, motor_frequency[1]);
        notch_filter_set_center_frequency_Q_constant(&gyro_x_filter_motor_FR, motor_frequency[2]);
        notch_filter_set_center_frequency_Q_constant(&gyro_x_filter_motor_FL, motor_frequency[3]);

        notch_filter_set_center_frequency_Q_constant(&gyro_y_filter_motor_BL, motor_frequency[0]);
        notch_filter_set_center_frequency_Q_constant(&gyro_y_filter_motor_BR, motor_frequency[1]);
        notch_filter_set_center_frequency_Q_constant(&gyro_y_filter_motor_FR, motor_frequency[2]);
        notch_filter_set_center_frequency_Q_constant(&gyro_y_filter_motor_FL, motor_frequency[3]);

        notch_filter_set_center_frequency_Q_constant(&gyro_z_filter_motor_BL, motor_frequency[0]);
        notch_filter_set_center_frequency_Q_constant(&gyro_z_filter_motor_BR, motor_frequency[1]);
        notch_filter_set_center_frequency_Q_constant(&gyro_z_filter_motor_FR, motor_frequency[2]);
        notch_filter_set_center_frequency_Q_constant(&gyro_z_filter_motor_FL, motor_frequency[3]);

        // Apply the filter to each axis
        gyro_angular[0] = notch_filter_read(&gyro_x_filter_motor_BL, gyro_angular[0]);
        gyro_angular[0] = notch_filter_read(&gyro_x_filter_motor_BR, gyro_angular[0]);
        gyro_angular[0] = notch_filter_read(&gyro_x_filter_motor_FR, gyro_angular[0]);
        gyro_angular[0] = notch_filter_read(&gyro_x_filter_motor_FL, gyro_angular[0]);

        gyro_angular[1] = notch_filter_read(&gyro_y_filter_motor_BL, gyro_angular[1]);
        gyro_angular[1] = notch_filter_read(&gyro_y_filter_motor_BR, gyro_angular[1]);
        gyro_angular[1] = notch_filter_read(&gyro_y_filter_motor_FR, gyro_angular[1]);
        gyro_angular[1] = notch_filter_read(&gyro_y_filter_motor_FL, gyro_angular[1]);

        gyro_angular[2] = notch_filter_read(&gyro_z_filter_motor_BL, gyro_angular[2]);
        gyro_angular[2] = notch_filter_read(&gyro_z_filter_motor_BR, gyro_angular[2]);
        gyro_angular[2] = notch_filter_read(&gyro_z_filter_motor_FR, gyro_angular[2]);
        gyro_angular[2] = notch_filter_read(&gyro_z_filter_motor_FL, gyro_angular[2]);
    }

