Rokasbarasa1/STM32-Quadcopter/src/main.c
                // if(gps_hold_roll_adjustment_calculation > gps_pid_angle_of_attack_max){
                //     gps_hold_roll_adjustment_calculation = gps_pid_angle_of_attack_max;
                // }else if(gps_hold_roll_adjustment_calculation < -gps_pid_angle_of_attack_max){
                //     gps_hold_roll_adjustment_calculation = -gps_pid_angle_of_attack_max;
                // } 
            
                // if(gps_hold_pitch_adjustment_calculation > gps_pid_angle_of_attack_max){
                //     gps_hold_pitch_adjustment_calculation = gps_pid_angle_of_attack_max;
                // }else if(gps_hold_pitch_adjustment_calculation < -gps_pid_angle_of_attack_max){
                //     gps_hold_pitch_adjustment_calculation = -gps_pid_angle_of_attack_max;
                // }
                
                // gps_hold_roll_adjustment = gps_hold_roll_adjustment_integral + map_value(
                //     gps_hold_roll_adjustment_calculation, 
                //     -gps_pid_angle_of_attack_max, 
                //     gps_pid_angle_of_attack_max, 
                //     -pitch_attack_step, 
                //     pitch_attack_step
                // );

                // gps_hold_pitch_adjustment = gps_hold_pitch_adjustment_calculation + map_value(
                //     gps_hold_pitch_adjustment_calculation, 
                //     -gps_pid_angle_of_attack_max, 
                //     gps_pid_angle_of_attack_max, 
                //     -pitch_attack_step, 
                //     pitch_attack_step
                // );

                // if(gps_hold_roll_adjustment > gps_pid_angle_of_attack_max){
                //     gps_hold_roll_adjustment = gps_pid_angle_of_attack_max;
                // }else if(gps_hold_roll_adjustment < -gps_pid_angle_of_attack_max){
                //     gps_hold_roll_adjustment = -gps_pid_angle_of_attack_max;
                // }
                
                // if(gps_hold_pitch_adjustment > gps_pid_angle_of_attack_max){
                //     gps_hold_pitch_adjustment = gps_pid_angle_of_attack_max;
                // }else if(gps_hold_pitch_adjustment < -gps_pid_angle_of_attack_max){
                //     gps_hold_pitch_adjustment = -gps_pid_angle_of_attack_max;
                // }



                if(gps_hold_roll_adjustment_calculation > gps_pid_angle_of_attack_max){
                    gps_hold_roll_adjustment_calculation = gps_pid_angle_of_attack_max;
                }else if(gps_hold_roll_adjustment_calculation < -gps_pid_angle_of_attack_max){
                    gps_hold_roll_adjustment_calculation = -gps_pid_angle_of_attack_max;
                } 
            
                if(gps_hold_pitch_adjustment_calculation > gps_pid_angle_of_attack_max){
                    gps_hold_pitch_adjustment_calculation = gps_pid_angle_of_attack_max;
                }else if(gps_hold_pitch_adjustment_calculation < -gps_pid_angle_of_attack_max){
                    gps_hold_pitch_adjustment_calculation = -gps_pid_angle_of_attack_max;
                }

                gps_hold_roll_adjustment = gps_hold_roll_adjustment_calculation;
                gps_hold_pitch_adjustment = gps_hold_pitch_adjustment_calculation;
                
                // printf("%f;%f;%f;%f;%.2f;%.2f;%.2f;%.2f;%.2f;", target_latitude, target_longitude, gps_latitude, gps_longitude, gps_hold_roll_adjustment, gps_hold_pitch_adjustment, imu_orientation[0], imu_orientation[1], imu_orientation[2]);
                // printf("%.2f;%.2f;%.2f;%.2f;", roll_effect_on_lat, roll_effect_on_lon, pitch_effect_on_lat, pitch_effect_on_lon);
                // printf("\n");

                last_error_roll = gps_hold_roll_adjustment;
                last_error_pitch = gps_hold_pitch_adjustment;

                // printf("off: %3.1f %3.1f\n", gps_hold_roll_adjustment, gps_hold_pitch_adjustment);
            }else if(gps_position_hold_enabled && got_gps == 0){
                // Put in the same values'
                gps_hold_roll_adjustment = last_error_roll;
                gps_hold_pitch_adjustment = last_error_pitch;
            }
        }
        motor2 = DWT->CYCCNT;
        

        // ---------------------------------------------------------------------------------------------- Altitude hold
        if(use_vertical_velocity_control){
            pid_set_desired_value(&vertical_velocity_pid, target_vertical_velocity);
            error_vertical_velocity = pid_get_error(&vertical_velocity_pid, vertical_velocity, get_absolute_time());
        }else{
            error_vertical_velocity = 0;
        }

        motor3 = DWT->CYCCNT;

        // ---------------------------------------------------------------------------------------------- Angle mode
        if(use_angle_mode){
            pid_set_desired_value(&angle_roll_pid, angle_target_roll + gps_hold_roll_adjustment);
            pid_set_desired_value(&angle_pitch_pid, angle_target_pitch + gps_hold_pitch_adjustment);

            // For now not logging desired angle mode
            error_angle_roll = pid_get_error(&angle_roll_pid, imu_orientation[0], get_absolute_time());
            error_angle_pitch = pid_get_error(&angle_pitch_pid, imu_orientation[1], get_absolute_time());

        }else{
            error_angle_roll = 0;
            error_angle_pitch = 0;
        }

        motor4 = DWT->CYCCNT;

        // ---------------------------------------------------------------------------------------------- Acro mode
        if(use_angle_mode){
            pid_set_desired_value(&acro_roll_pid, error_angle_roll);
            pid_set_desired_value(&acro_pitch_pid, error_angle_pitch);
            pid_set_desired_value(&acro_yaw_pid, acro_target_yaw);
            
            PID_set_points[0] = error_angle_roll; // Logging
            PID_set_points[1] = error_angle_pitch; // Logging
            PID_set_points[2] = acro_target_yaw; // Logging
        }else{
            pid_set_desired_value(&acro_roll_pid, acro_target_roll);
            pid_set_desired_value(&acro_pitch_pid, acro_target_pitch);
            pid_set_desired_value(&acro_yaw_pid, acro_target_yaw);
            
