Rokasbarasa1/STM32-Quadcopter/src/main.c
            PID_set_points[0] = acro_target_roll; // Logging
            PID_set_points[1] = acro_target_pitch; // Logging
            PID_set_points[2] = acro_target_yaw; // Logging
        }


        error_acro_roll = pid_get_error(&acro_roll_pid, gyro_angular[0], get_absolute_time());
        error_acro_pitch = pid_get_error(&acro_pitch_pid, gyro_angular[1], get_absolute_time());
        error_acro_yaw = pid_get_error(&acro_yaw_pid, gyro_angular[2], get_absolute_time());

        PID_proportional[1] = pid_get_last_proportional_error(&acro_roll_pid); // Logging
        PID_integral[1] = pid_get_last_integral_error(&acro_roll_pid); // Logging
        PID_derivative[1] = pid_get_last_derivative_error(&acro_roll_pid); // Logging
        PID_proportional[0] = pid_get_last_proportional_error(&acro_pitch_pid); // Logging
        PID_integral[0] = pid_get_last_integral_error(&acro_pitch_pid); // Logging
        PID_derivative[0] = pid_get_last_derivative_error(&acro_pitch_pid); // Logging
        PID_proportional[2] = pid_get_last_proportional_error(&acro_yaw_pid); // Logging
        PID_integral[2] = pid_get_last_integral_error(&acro_yaw_pid); // Logging

        motor5 = DWT->CYCCNT;

        // ---------------------------------------------------------------------------------------------- Throttle
        error_throttle = throttle*0.9;

        // ---------------------------------------------------------------------------------------------- Applying to throttle to escs
        // motor_power[0] = ( error_acro_roll) + ( error_acro_pitch) + ( error_acro_yaw);
        // motor_power[1] = (-error_acro_roll) + ( error_acro_pitch) + (-error_acro_yaw);
        // motor_power[2] = (-error_acro_roll) + (-error_acro_pitch) + ( error_acro_yaw);
        // motor_power[3] = ( error_acro_roll) + (-error_acro_pitch) + (-error_acro_yaw);

        motor_power[0] = 0;
        motor_power[1] = 0;
        motor_power[2] = 0;
        motor_power[3] = 0;

        // For throttle control logic
        motor_power[0] += error_throttle * (~use_vertical_velocity_control & 1) + error_vertical_velocity * use_vertical_velocity_control;
        motor_power[1] += error_throttle * (~use_vertical_velocity_control & 1) + error_vertical_velocity * use_vertical_velocity_control;
        motor_power[2] += error_throttle * (~use_vertical_velocity_control & 1) + error_vertical_velocity * use_vertical_velocity_control;
        motor_power[3] += error_throttle * (~use_vertical_velocity_control & 1) + error_vertical_velocity * use_vertical_velocity_control;

        // 2212
        // Motor B (0) 14460 rpm BL but should be BL
        // Motor C (1) 14160 rpm FL but should be BR
        // Motor D (2) 14460 rpm BR but should be FR
        // Motor A (3) 13740 rpm FR but should be FL
        throttle_value_FR = setServoActivationPercent(motor_power[2], actual_min_dshot600_throttle_value, actual_max_dshot600_throttle_value);
        throttle_value_FL = setServoActivationPercent(motor_power[3], actual_min_dshot600_throttle_value, actual_max_dshot600_throttle_value);
        throttle_value_BL = setServoActivationPercent(motor_power[0], actual_min_dshot600_throttle_value, actual_max_dshot600_throttle_value);
        throttle_value_BR = setServoActivationPercent(motor_power[1], actual_min_dshot600_throttle_value, actual_max_dshot600_throttle_value);

        // FPV cam side FRONT
        bdshot600_dma_set_throttle(throttle_value_FR, motor_FR); // Front-right
        bdshot600_dma_set_throttle(throttle_value_FL, motor_FL); // Front-left
        // GPS side BACK
        bdshot600_dma_set_throttle(throttle_value_BL, motor_BL); // Back-left
        bdshot600_dma_set_throttle(throttle_value_BR, motor_BR); // Back-right

        // For logging
        motor_power[0] = throttle_value_BL; // Logging BL <- BL
        motor_power[1] = throttle_value_FL; // Logging FL <- FL
        motor_power[2] = throttle_value_BR; // Logging BR <- BR
        motor_power[3] = throttle_value_FR; // Logging FR <- FR

        motor6 = DWT->CYCCNT;

        // printf("g\n");
    }else{
        // printf("b\n");
        throttle_value_FR = min_dshot600_throttle_value;
        throttle_value_FL = min_dshot600_throttle_value;
        throttle_value_BL = min_dshot600_throttle_value;
        throttle_value_BR = min_dshot600_throttle_value;

        // FPV cam side FRONT
        bdshot600_dma_set_throttle(throttle_value_FR, motor_FR); // Front-right
        bdshot600_dma_set_throttle(throttle_value_FL, motor_FL); // Front-left
        // GPS side BACK
        bdshot600_dma_set_throttle(throttle_value_BL, motor_BL); // Back-left
        bdshot600_dma_set_throttle(throttle_value_BR, motor_BR); // Back-right

        // For logging
        motor_power[0] = throttle_value_BL; // Logging BL <- BL
        motor_power[1] = throttle_value_FL; // Logging FL <- FL
        motor_power[2] = throttle_value_BR; // Logging BR <- BR
        motor_power[3] = throttle_value_FR; // Logging FR <- FR

        // Reset the remote control set points also
        remote_control[0] = 0;
        remote_control[1] = 0;
        remote_control[2] = 0;
        remote_control[3] = 0;

        PID_proportional[0] = 0; // Logging
        PID_proportional[1] = 0; // Logging
        PID_proportional[2] = 0; // Logging

        PID_integral[0] = 0; // Logging
        PID_integral[1] = 0; // Logging
        PID_integral[2] = 0; // Logging

        PID_derivative[0] = 0; // Logging
        PID_derivative[1] = 0; // Logging

        PID_set_points[0] = 0; // Logging
        PID_set_points[1] = 0; // Logging
        PID_set_points[2] = 0; // Logging

        pid_reset_integral_sum(&acro_roll_pid);
        pid_reset_integral_sum(&acro_pitch_pid);
        pid_reset_integral_sum(&acro_yaw_pid);

        pid_reset_integral_sum(&angle_pitch_pid);
        pid_reset_integral_sum(&angle_roll_pid);

        pid_reset_integral_sum(&gps_longitude_pid);
        pid_reset_integral_sum(&gps_latitude_pid);
    }

    // Immediately after getting the motor values send them to motors. If manual mode is on
    if(manual_bdshot) bdshot600_dma_send_all_motor_data();
}

void handle_radio_communication(){
    if(nrf24_data_available(1)){
        nrf24_receive(rx_data);
        // Get the type of request
        extract_request_type(rx_data, strlen(rx_data), rx_type);

        radio2 = DWT->CYCCNT;
        if(strcmp(rx_type, "js") == 0){
            // printf("JOYSTICK\n");
            last_signal_timestamp_microseconds = get_absolute_time();

            // extract_joystick_request_values_uint(rx_data, strlen(rx_data), &throttle, &yaw, &roll, &pitch);
            extract_joystick_request_values_float(rx_data, strlen(rx_data), &throttle, &yaw, &roll, &pitch);

            // Reversed
            roll = (-(roll-50.0))+50.0;

            // For the blackbox log
            remote_control[0] = roll;
            remote_control[1] = pitch-50.0;
            remote_control[2] = yaw-50.0;
            remote_control[3] = throttle+100.0;

