Rokasbarasa1/STM32-Quadcopter/src/main.c
            // the controls were inverse

            // If pitch and roll are neutral then try holding position with gps
            if(pitch == 50.0 && roll == 50.0 && gps_fix_type == 3 && use_gps_hold == 1 && gps_target_set == 0){
                gps_position_hold_enabled = 1;
                // Current gps position is the target now
                target_latitude = gps_latitude;
                target_longitude = gps_longitude;
                gps_target_set = 1;
                // printf("GPS STATE SET\n");
            }else if (pitch != 50.0 || roll != 50.0 ){
                if(use_gps_reset_count >= use_gps_reset_count_to_deactivate){
                    gps_position_hold_enabled = 0;
                    gps_target_set = 0;
                    // printf("GPS STATE RESET, GPS FIX %d\n", gps_fix_type);
                    use_gps_reset_count = 0;
                }else{
                    use_gps_reset_count++;
                }
            }

            // The remote control itself handles the deadband stuff

            // Roll ##################################################################################################################
            if(roll == 50.0){
                acro_target_roll = 0.0;
                angle_target_roll = 0.0;
            }else {
                acro_target_roll = map_value(roll, 0.0, 100.0, -acro_mode_rate_degrees_per_second, acro_mode_rate_degrees_per_second);
                angle_target_roll = map_value(roll, 0.0, 100.0, -max_roll_attack, max_roll_attack);
            }
            // Pitch ##################################################################################################################
            if(pitch == 50.0){
                acro_target_pitch = 0.0;
                angle_target_pitch = 0.0;
            }else{   
                acro_target_pitch = map_value(pitch, 0.0, 100.0, -acro_mode_rate_degrees_per_second, acro_mode_rate_degrees_per_second);
                angle_target_pitch = map_value(pitch, 0.0, 100.0, -max_pitch_attack, max_pitch_attack);
            }


            // Yaw ##################################################################################################################
            if(yaw == 50) acro_target_yaw = 0;
            else acro_target_yaw = map_value(yaw, 0.0, 100.0, -max_yaw_attack, max_yaw_attack);

            // Throttle ##################################################################################################################
            target_vertical_velocity = map_value(throttle, 0, 100, -max_throttle_vertical_velocity, max_throttle_vertical_velocity);




        }else if(strcmp(rx_type, "pid") == 0){
            printf("\nGot pid");
            
            float added_proportional = 0;
            float added_integral = 0;
            float added_derivative = 0;
            float added_master_gain = 0;

            extract_pid_request_values(rx_data, strlen(rx_data), &added_proportional, &added_integral, &added_derivative, &added_master_gain);

            
            if(!use_angle_mode){ // ACRO MODE
                acro_roll_pitch_gain_p = BASE_ACRO_roll_pitch_GAIN_P + added_proportional;
                acro_roll_pitch_gain_i = BASE_ACRO_roll_pitch_GAIN_I + added_integral;
                acro_roll_pitch_gain_d = BASE_ACRO_roll_pitch_GAIN_D + added_derivative;
                acro_roll_pitch_master_gain = BASE_ACRO_roll_pitch_MASTER_GAIN + added_master_gain;


                // Configure the roll pid 
                pid_set_proportional_gain(&acro_roll_pid, acro_roll_pitch_gain_p * acro_roll_pitch_master_gain);
                pid_set_integral_gain(&acro_roll_pid, acro_roll_pitch_gain_i * acro_roll_pitch_master_gain);
                pid_set_derivative_gain(&acro_roll_pid, acro_roll_pitch_gain_d * acro_roll_pitch_master_gain);
                pid_reset_integral_sum(&acro_roll_pid);

                // Configure the pitch pid 
                pid_set_proportional_gain(&acro_pitch_pid, acro_roll_pitch_gain_p * acro_roll_pitch_master_gain);
                pid_set_integral_gain(&acro_pitch_pid, acro_roll_pitch_gain_i * acro_roll_pitch_master_gain);
                pid_set_derivative_gain(&acro_pitch_pid, acro_roll_pitch_gain_d * acro_roll_pitch_master_gain);
                pid_reset_integral_sum(&acro_pitch_pid);
            }

            if(use_angle_mode){ // ANGLE MODE
                angle_roll_pitch_gain_p = BASE_ANGLE_roll_pitch_GAIN_P + added_proportional;
                angle_roll_pitch_gain_i = BASE_ANGLE_roll_pitch_GAIN_I + added_integral;
                angle_roll_pitch_gain_d = BASE_ANGLE_roll_pitch_GAIN_D + added_derivative;
                angle_roll_pitch_master_gain = BASE_ANGLE_roll_pitch_MASTER_GAIN + added_master_gain;

                added_angle_roll_pitch_gain_p = added_proportional;
                added_angle_roll_pitch_gain_i = added_integral;
                added_angle_roll_pitch_gain_d = added_derivative;
                added_angle_roll_pitch_master_gain = added_master_gain;

                // Configure the pitch pid 
                pid_set_proportional_gain(&angle_pitch_pid, angle_roll_pitch_gain_p * angle_roll_pitch_master_gain);
                pid_set_integral_gain(&angle_pitch_pid, angle_roll_pitch_gain_i * angle_roll_pitch_master_gain);
                pid_set_derivative_gain(&angle_pitch_pid, angle_roll_pitch_gain_d * angle_roll_pitch_master_gain);
                pid_reset_integral_sum(&angle_pitch_pid);

                // Configure the roll pid 
                pid_set_proportional_gain(&angle_roll_pid, angle_roll_pitch_gain_p * angle_roll_pitch_master_gain);
                pid_set_integral_gain(&angle_roll_pid, angle_roll_pitch_gain_i * angle_roll_pitch_master_gain);
                pid_set_derivative_gain(&angle_roll_pid, angle_roll_pitch_gain_d * angle_roll_pitch_master_gain);
                pid_reset_integral_sum(&angle_roll_pid);
            }


            // Start new log blackbox log file if one was running.
            if(sd_card_initialized && use_blackbox_logging){
                HAL_Delay(300);

                // Add end of file to the current file
                uint16_t string_length = 0;
                char *betaflight_end_file_string = betaflight_blackbox_get_end_of_log(&string_length);

                char* sd_card_buffer = sd_card_get_buffer_pointer(1);
                uint16_t sd_card_buffer_index = 0;
                uint16_t betaflight_data_string_index = 0;
                while(sd_card_buffer_index < string_length){
                    sd_card_buffer[sd_card_buffer_index] = betaflight_end_file_string[sd_card_buffer_index];
                    sd_card_buffer_increment_index();
                    sd_card_buffer_index++;
                    betaflight_data_string_index++;
                }
                free(betaflight_end_file_string);

                if(use_simple_async){
                    sd_special_write_chunk_of_string_data_no_slave_response(sd_card_get_buffer_pointer(1));
                    sd_buffer_clear(1);
                }else{
                    if(use_blackbox_logging){
                        sd_special_write_chunk_of_byte_data_async(sd_card_get_buffer_pointer(1), string_length);
                        sd_buffer_swap();
                        sd_buffer_clear(1);
                    }else{
                        sd_special_write_chunk_of_string_data_async(sd_card_get_buffer_pointer(1));
                        sd_buffer_swap();
                        sd_buffer_clear(1);
                    }
                }

                printf("PID: Sent file ending\n");
                
