Rokasbarasa1/STM32-Quadcopter/src/main.c
                // Wait for the logger finish writing everything
                HAL_Delay(300);
                printf("PID: Delayed for 2s\n");

                // Exit async mode
                uint64_t i = 0;
                while(1){
                    printf("%lu\n", i);
                    if(sd_special_leave_async_mode()){
                        printf("Exit async mode\n");
                        break;
                    }
                    i++;
                }
                printf("PID: Left async mode\n");

                // Close the current file
                sd_special_reset();
                printf("PID: Reset the logger\n");

                HAL_Delay(1000);
                printf("PID: Waited for 1s\n");

                // Initialize new_file
                setup_logging_to_sd(1);
                printf("PID: Initialized logging again\n");

            }
            

        }else if(strcmp(rx_type, "remoteSyncBase") == 0){
            printf("\nGot remoteSyncBase");
            send_pid_base_info_to_remote();
        }else if(strcmp(rx_type, "remoteSyncAdded") == 0){
            printf("\nGot remoteSyncAdded");
            send_pid_added_info_to_remote();
        }else if(strcmp(rx_type, "accel") == 0){

            float added_x_axis_offset;
            float added_y_axis_offset;

            extract_accelerometer_offsets(rx_data, strlen(rx_data), &added_x_axis_offset, &added_y_axis_offset);
            printf("\nGot offsets %f %f ", -added_x_axis_offset, -added_y_axis_offset);

            accelerometer_roll_offset = base_accelerometer_roll_offset - added_x_axis_offset;
            accelerometer_pitch_offset = base_accelerometer_pitch_offset -  added_y_axis_offset;

            pid_reset_integral_sum(&angle_roll_pid);
            pid_reset_integral_sum(&angle_pitch_pid);

            calibrate_gyro(); // Recalibrate the gyro as the temperature affects the calibration

            // Get the initial position again
            get_initial_position();

            // Capture any radio messages that were sent durring the calibration proccess and discard them
            for (uint8_t i = 0; i < 50; i++){
                if(nrf24_data_available(1)){
                    nrf24_receive(rx_data);
                }
            }

            // Reset the sesor fusion and the pid accumulation
        }else if(strcmp(rx_type, "fm") == 0){
            printf("\nGot flight mode");

            uint8_t new_flight_mode;

            extract_flight_mode(rx_data, strlen(rx_data), &new_flight_mode);

            printf("\nGot new flight mode %d\n", new_flight_mode);
            flight_mode = new_flight_mode;

            set_flight_mode(flight_mode);

            find_accelerometer_error(10);

        }

        rx_type[0] = '\0'; // Clear out the string by setting its first char to string terminator
    }
}


void initialize_control_abstractions(){
    acro_roll_pid = pid_init(acro_roll_pitch_master_gain * acro_roll_pitch_gain_p, acro_roll_pitch_master_gain * acro_roll_pitch_gain_i, acro_roll_pitch_master_gain * acro_roll_pitch_gain_d, 0.0, get_absolute_time(), 25, -25, 1);
    acro_pitch_pid = pid_init(acro_roll_pitch_master_gain * acro_roll_pitch_gain_p, acro_roll_pitch_master_gain * acro_roll_pitch_gain_i, acro_roll_pitch_master_gain * acro_roll_pitch_gain_d, 0.0, get_absolute_time(), 25, -25, 1);
    acro_yaw_pid = pid_init(acro_yaw_gain_p, acro_yaw_gain_i, 0, 0.0, get_absolute_time(), 10.0, -10.0, 1);

    angle_roll_pid = pid_init(angle_roll_pitch_master_gain * angle_roll_pitch_gain_p, angle_roll_pitch_master_gain * angle_roll_pitch_gain_i, angle_roll_pitch_master_gain * angle_roll_pitch_gain_d, 0.0, get_absolute_time(), acro_mode_rate_degrees_per_second, -acro_mode_rate_degrees_per_second, 1);
    angle_pitch_pid = pid_init(angle_roll_pitch_master_gain * angle_roll_pitch_gain_p, angle_roll_pitch_master_gain * angle_roll_pitch_gain_i, angle_roll_pitch_master_gain * angle_roll_pitch_gain_d, 0.0, get_absolute_time(), acro_mode_rate_degrees_per_second, -acro_mode_rate_degrees_per_second, 1);

    vertical_velocity_pid = pid_init(vertical_velocity_gain_p, vertical_velocity_gain_i, vertical_velocity_gain_d, 0.0, get_absolute_time(), 90.0, 0.0, 1); // Min value is 0 because motors dont go lower that that

    gps_longitude_pid = pid_init(gps_hold_gain_p, gps_hold_gain_i, gps_hold_gain_d, 0.0, get_absolute_time(), gps_pid_angle_of_attack_max, -gps_pid_angle_of_attack_max, 1);
    gps_latitude_pid = pid_init(gps_hold_gain_p, gps_hold_gain_i, gps_hold_gain_d, 0.0, get_absolute_time(), gps_pid_angle_of_attack_max, -gps_pid_angle_of_attack_max, 1);

    filter_magnetometer_x = filtering_init_low_pass_filter(filtering_magnetometer_cutoff_frequency,REFRESH_RATE_HZ);
    filter_magnetometer_y = filtering_init_low_pass_filter(filtering_magnetometer_cutoff_frequency,REFRESH_RATE_HZ);
    filter_magnetometer_z = filtering_init_low_pass_filter(filtering_magnetometer_cutoff_frequency,REFRESH_RATE_HZ);

    filter_accelerometer_x = filtering_init_low_pass_filter(filtering_accelerometer_cutoff_frequency,REFRESH_RATE_HZ);
    filter_accelerometer_y = filtering_init_low_pass_filter(filtering_accelerometer_cutoff_frequency,REFRESH_RATE_HZ);
    filter_accelerometer_z = filtering_init_low_pass_filter(filtering_accelerometer_cutoff_frequency,REFRESH_RATE_HZ);

    // Width does not matter and frequency will be set later using data from motors
    gyro_x_filter_motor_FR = notch_filter_init(0, 0, REFRESH_RATE_HZ);
    notch_filter_set_Q(&gyro_x_filter_motor_FR, rpm_notch_filter_q_value);
    gyro_x_filter_motor_FL = notch_filter_init(0, 0, REFRESH_RATE_HZ);
    notch_filter_set_Q(&gyro_x_filter_motor_FL, rpm_notch_filter_q_value);
    gyro_x_filter_motor_BR = notch_filter_init(0, 0, REFRESH_RATE_HZ);
    notch_filter_set_Q(&gyro_x_filter_motor_BR, rpm_notch_filter_q_value);
    gyro_x_filter_motor_BL = notch_filter_init(0, 0, REFRESH_RATE_HZ);
    notch_filter_set_Q(&gyro_x_filter_motor_BL, rpm_notch_filter_q_value);

